cf/Enums/BusinessPartnersAttributesTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>BusinessPartnersAttributesTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>LongDescription</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VATNumber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LegalAddress</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccountByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessCalendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileFacsimilePrinting</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeVATInPrice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntityIndividual</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LogoFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCashByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PettyCashes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationCountry</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.WorldCountries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ActivityTypes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ActivityType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ActivityTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/Taxes/Ext/Module.bsl
Function GetVATRate(Company, BusinessAccountingGroup, ItemAccountingGroup) Export 
	
	If TypeOf(BusinessAccountingGroup) = TypeOf(Catalogs.CustomerAccountingGroups.EmptyRef()) Then
		If BusinessAccountingGroup.LocationType = Enums.BusinessPartnersLocationTypes.Domestic Then
			Return ItemAccountingGroup.DomesticCustomerVATRate;
		ElsIf BusinessAccountingGroup.LocationType = Enums.BusinessPartnersLocationTypes.EuropeanUnion Then	
			Return ItemAccountingGroup.EuropeanUnionCustomerVATRate;
		ElsIf BusinessAccountingGroup.LocationType = Enums.BusinessPartnersLocationTypes.Foreign Then		
			Return ItemAccountingGroup.ForeignCustomerVATRate;
		EndIf;	
	ElsIf TypeOf(BusinessAccountingGroup) = TypeOf(Catalogs.SupplierAccountingGroups.EmptyRef()) Then	
		If BusinessAccountingGroup.LocationType = Enums.BusinessPartnersLocationTypes.Domestic Then
			Return ItemAccountingGroup.DomesticSupplierVATRate;
		ElsIf BusinessAccountingGroup.LocationType = Enums.BusinessPartnersLocationTypes.EuropeanUnion Then	
			Return ItemAccountingGroup.EuropeanUnionSupplierVATRate;
		ElsIf BusinessAccountingGroup.LocationType = Enums.BusinessPartnersLocationTypes.Foreign Then		
			Return ItemAccountingGroup.ForeignSupplierVATRate;
		EndIf;	
	EndIf;	
	
EndFunction // GetVATRate()

//Creates "nice" VATNumber presentation for print forms, etc.
// Replaces given VATNumber in any presentation (e.g. "raw" - no formatting) 
// with a presentation aligned with system settings provided by user.
//
Function GetVATNumberPresentation(VATNumber, TemplatesStructure = Undefined) Export
	
	VATNumberOnlyDigits = "";
	VATNumberLength = StrLen(VATNumber);
	
	//Retrieve VATNumber numbers, remove any other characters
	For a = 1 To VATNumberLength Do
		
		VATNumberChar = Mid(VATNumber, a, 1);
		If Find("0123456789", VATNumberChar) > 0 Then
			VATNumberOnlyDigits = VATNumberOnlyDigits + VATNumberChar;
		EndIf;
		
	EndDo;
	
	VATNumberOnlyDigitsLength = StrLen(VATNumberOnlyDigits);
	If VATNumberOnlyDigitsLength = 0 Then
		Return VATNumber;
	EndIf;
	
	//Retrieve VATNumber template for given VATNumber length
	If TemplatesStructure = Undefined Then
		TemplatesStructure = Constants.VATNumberFormatStrings.Get().Get();
	EndIf;
	
	If TypeOf(TemplatesStructure) <> Type("Map") Then
		Return VATNumber;
	EndIf; 
	
	VATNumberTemplate = TemplatesStructure.Get(VATNumberOnlyDigitsLength);
	
	If VATNumberTemplate = Undefined Then
		Return VATNumber;
	EndIf;
	
	
	//Apply VATNumber template to VATNumber
	AdjustedVATNumber = "";
	FigureNumber = 0;
	VATNumberTemplateLength = StrLen(VATNumberTemplate);
	
	For a = 1 To VATNumberTemplateLength Do
		
		TemplateChar = Mid(VATNumberTemplate, a, 1);
		
		If TemplateChar = "9" Then
			FigureNumber = FigureNumber + 1;
			AdjustedVATNumber = AdjustedVATNumber + Mid(VATNumberOnlyDigits, FigureNumber, 1);
		Else
			AdjustedVATNumber = AdjustedVATNumber + TemplateChar;
		EndIf;
		
	EndDo;
	
	Return AdjustedVATNumber;
	
EndFunction //GetVATNumberPresentation()

Function GetVATNumberPresentationWithCash(VATNumber, TemplatesStructure, FormattedVATNumbersMap) Export
	
	AdjustedVATNumber = FormattedVATNumbersMap[VATNumber];
	
	If AdjustedVATNumber = Undefined Then
		
		AdjustedVATNumber = GetVATNumberPresentation(VATNumber, TemplatesStructure);
		FormattedVATNumbersMap.Insert(VATNumber, AdjustedVATNumber);
		
	EndIf;
	
	Return AdjustedVATNumber;
	
EndFunction // GetVATNumberPresentationWithCash()

Function GetBusinessPartnerVATNumberDescription(Date, BusinessPartner, LanguageCode, ForLocationType = Undefined) Export
	
	Return Alerts.ParametrizeString(Nstr("en = 'VAT number: %P1'; pl = 'NIP: %P1'; ru = 'ИНН: %P1'",LanguageCode) ,New Structure("P1",GetBusinessPartnerVATNumberPresentation(Date,BusinessPartner,ForLocationType)));
	
EndFunction	

Function GetBusinessPartnerVATNumberPresentation(Date, BusinessPartner, ForLocationType = Undefined, Val Country = Undefined) Export
	
	If Country = Catalogs.Countries.Poland Or ValueIsNotFilled(Country) Then
		Country = Undefined;
	EndIf;
	
	If ValueIsNotFilled(BusinessPartner) Then
		Return "";
	EndIf;
	
	If Not Country = Undefined Then
		Return InformationRegisters.BusinessPartnersAttributesHistory.GetLast(Date, New Structure("BusinessPartner, Attribute, Country", BusinessPartner, Enums.BusinessPartnersAttributesTypes.VATNumber, Country)).Description;
	EndIf;
	
	VATNumberPrefix = "";
	VATNumber = InformationRegisters.BusinessPartnersAttributesHistory.GetLast(Date, New Structure("BusinessPartner, Attribute", BusinessPartner, Enums.BusinessPartnersAttributesTypes.VATNumber)).Description;

	If ForLocationType = Undefined Or ForLocationType = Enums.BusinessPartnersLocationTypes.Domestic Then
		VATNumber = GetVATNumberPresentation(VATNumber);
	Else
		If TypeOf(BusinessPartner) = TypeOf(Catalogs.Companies.EmptyRef()) Then
			VATNumberPrefix = BusinessPartner.VATNumberPrefix + " ";
			VATNumber = GetVATNumberPresentation(VATNumber);
		EndIf;	
	EndIf;
	
	Return VATNumberPrefix + VATNumber;
EndFunction
